In [ ]:
import pandas as pd

In [ ]:
wth1 = pd.read_csv('/content/drive/MyDrive/nyc_weather_2018.csv')
wth2 = pd.read_csv('/content/drive/MyDrive/weather_stations.csv')

In [ ]:
wth1.head()

                  date datatype            station attributes  value
0  2018-01-01T00:00:00     PRCP  GHCND:US1CTFR0039       ,,N,    0.0
1  2018-01-01T00:00:00     PRCP  GHCND:US1NJBG0015       ,,N,    0.0
2  2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0015       ,,N,    0.0
3  2018-01-01T00:00:00     PRCP  GHCND:US1NJBG0017       ,,N,    0.0
4  2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0017       ,,N,    0.0

In [ ]:
wth2= wth2.rename(dict (id = 'station'), axis= 1)
wth2.head()

             station                           name  ...  longitude  elevation
0  GHCND:US1CTFR0022        STAMFORD 2.6 SSW, CT US  ... -73.577000       36.6
1  GHCND:US1CTFR0039          STAMFORD 4.2 S, CT US  ... -73.568176        6.4
2  GHCND:US1NJBG0001      BERGENFIELD 0.3 SW, NJ US  ... -74.001983       20.1
3  GHCND:US1NJBG0002  SADDLE BROOK TWP 0.6 E, NJ US  ... -74.083358       16.8
4  GHCND:US1NJBG0003           TENAFLY 1.3 W, NJ US  ... -73.977500       21.6

[5 rows x 5 columns]

In [ ]:
wth1_snow = wth1[wth1.datatype == 'SNOW']
wth1_snow.head()

                   date datatype            station attributes  value
2   2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0015       ,,N,    0.0
4   2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0017       ,,N,    0.0
7   2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0018       ,,N,    0.0
10  2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0023       ,,N,    0.0
14  2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0039       ,,N,    0.0

In [ ]:
wth2_us = wth2[wth2.name.str.contains('NJ US')]
wth2_us.head()

             station                           name  ...  longitude  elevation
2  GHCND:US1NJBG0001      BERGENFIELD 0.3 SW, NJ US  ... -74.001983       20.1
3  GHCND:US1NJBG0002  SADDLE BROOK TWP 0.6 E, NJ US  ... -74.083358       16.8
4  GHCND:US1NJBG0003           TENAFLY 1.3 W, NJ US  ... -73.977500       21.6
5  GHCND:US1NJBG0005        WESTWOOD 0.8 ESE, NJ US  ... -74.015858       15.8
6  GHCND:US1NJBG0006            RAMSEY 0.6 E, NJ US  ... -74.134068      112.2

[5 rows x 5 columns]

In [ ]:
weather = wth1_snow.merge(wth2_us, on = 'station')
weather.head()

                  date datatype  ... longitude elevation
0  2018-01-01T00:00:00     SNOW  ... -74.13979      17.7
1  2018-01-02T00:00:00     SNOW  ... -74.13979      17.7
2  2018-01-03T00:00:00     SNOW  ... -74.13979      17.7
3  2018-01-04T00:00:00     SNOW  ... -74.13979      17.7
4  2018-01-06T00:00:00     SNOW  ... -74.13979      17.7

[5 rows x 9 columns]

In [ ]:
weather.shape

(8347, 9)

In [ ]:
weather['station'].unique().shape

(66,)

In [ ]:
weather.drop_duplicates('station', inplace= True)
weather.shape

(66, 9)

In [ ]:
weather.elevation.mean()

58.34848484848487

Load the fb dataset, then:•Calculate the percentage change between that and and last day in volumn (pct_change method)•Sort the dataframe by percentage change then get five days that have the biggest change.

In [ ]:
fb = pd.read_csv('/content/drive/MyDrive/fb_2018.csv')
fb.head()

         date    open    high       low   close    volume
0  2018-01-02  177.68  181.58  177.5500  181.42  18151903
1  2018-01-03  181.88  184.78  181.3300  184.67  16886563
2  2018-01-04  184.90  186.21  184.0996  184.33  13880896
3  2018-01-05  185.59  186.90  184.9300  186.85  13574535
4  2018-01-08  187.20  188.90  186.3300  188.28  17994726

In [ ]:
nfb = fb.assign(pct_change = lambda x: x.volume.pct_change())
nfb.head()

         date    open    high       low   close    volume  pct_change
0  2018-01-02  177.68  181.58  177.5500  181.42  18151903         NaN
1  2018-01-03  181.88  184.78  181.3300  184.67  16886563   -0.069708
2  2018-01-04  184.90  186.21  184.0996  184.33  13880896   -0.177992
3  2018-01-05  185.59  186.90  184.9300  186.85  13574535   -0.022071
4  2018-01-08  187.20  188.90  186.3300  188.28  17994726    0.325624

In [ ]:
nfb.sort_values(by='pct_change', ascending= False).head()

           date    open    high     low   close     volume  pct_change
8    2018-01-12  178.06  181.48  177.40  179.37   77551299    7.087876
52   2018-03-19  177.01  177.17  170.06  172.56   88140060    2.611789
142  2018-07-26  174.89  180.13  173.75  176.26  169803668    1.628841
182  2018-09-21  166.64  167.25  162.81  162.93   45994800    1.428956
57   2018-03-26  160.82  161.10  149.02  160.06  126116634    1.352496

Create bins for each full number of earthquake magnitude (for instance, the first bin is (0, 1], the second is (1, 2], and so on) with the ml magnitude type and count how many are in each bin.

In [ ]:
earthquakes = pd.read_csv("/content/drive/MyDrive/earthquakes.csv")
earthquakes.head()

  alert  cdi  ...        updated                                                url
0   NaN  NaN  ...  1539475395144  https://earthquake.usgs.gov/earthquakes/eventp...
1   NaN  NaN  ...  1539475253925  https://earthquake.usgs.gov/earthquakes/eventp...
2   NaN  4.4  ...  1539536756176  https://earthquake.usgs.gov/earthquakes/eventp...
3   NaN  NaN  ...  1539475196167  https://earthquake.usgs.gov/earthquakes/eventp...
4   NaN  NaN  ...  1539477547926  https://earthquake.usgs.gov/earthquakes/eventp...

[5 rows x 26 columns]

In [ ]:
mag_ml = earthquakes[earthquakes.magType=="ml"]
earthquakes = earthquakes.assign(mag_bin = pd.cut(mag_ml.mag,bins=5,labels=["nor","low","med","high","dangerous"]))
earthquakes.mag_bin.value_counts()

low          2990
med          2921
nor           509
high          372
dangerous      11
Name: mag_bin, dtype: int64

Load the dataset weather_by_station then:\ •Calculate the mean value each station recorded snow per month.\ •Count the number of times each station recorded snow per month.

In [ ]:
weather_by_station = pd.read_csv("/content/drive/MyDrive/weather_by_station.csv")
weather_by_station.head()

         date datatype  ... value                    station_name
0  2018-01-01     PRCP  ...   0.0           STAMFORD 4.2 S, CT US
1  2018-01-01     PRCP  ...   0.0  NORTH ARLINGTON 0.7 WNW, NJ US
2  2018-01-01     SNOW  ...   0.0  NORTH ARLINGTON 0.7 WNW, NJ US
3  2018-01-01     PRCP  ...   0.0        GLEN ROCK 0.7 SSE, NJ US
4  2018-01-01     SNOW  ...   0.0        GLEN ROCK 0.7 SSE, NJ US

[5 rows x 5 columns]

In [ ]:
weather_by_station.shape

(80256, 5)

In [ ]:
weather_snow = weather_by_station[weather_by_station.datatype == 'SNOW']

In [ ]:
import datetime

In [ ]:
weather_by_station.date = pd.to_datetime(weather_by_station.date)

In [ ]:
weather_by_station['month'] = weather_by_station['date'].dt.month

In [ ]:
weather_snow.head()

         date datatype  ...                    station_name  month
2  2018-01-01     SNOW  ...  NORTH ARLINGTON 0.7 WNW, NJ US      1
4  2018-01-01     SNOW  ...        GLEN ROCK 0.7 SSE, NJ US      1
7  2018-01-01     SNOW  ...   PALISADES PARK 0.2 WNW, NJ US      1
10 2018-01-01     SNOW  ...          OAKLAND 0.9 SSE, NJ US      1
14 2018-01-01     SNOW  ...       RIVER EDGE 0.4 NNE, NJ US      1

[5 rows x 6 columns]

In [ ]:
weather_snow.shape

(13395, 6)

In [ ]:
weather_snow.groupby(['month','station']).mean()

                            value
month station
1     GHCND:US1CTFR0039  29.00000
      GHCND:US1NJBG0003  30.00000
      GHCND:US1NJBG0015  12.10000
      GHCND:US1NJBG0017   6.44000
      GHCND:US1NJBG0018  10.62963
...                           ...
12    GHCND:USC00308577   0.00000
      GHCND:USW00014732   0.00000
      GHCND:USW00014734   0.00000
      GHCND:USW00094728   0.00000
      GHCND:USW00094789   0.00000

[841 rows x 1 columns]

In [ ]:
weather_snow.groupby('month').agg({'date': 'count'})

       date
month
1      1373
2       987
3      1399
4      1158
5      1053
6      1009
7      1118
8      1003
9       919
10     1044
11     1127
12     1205